import '../models/question_model.dart';

List<QuestionModel> questions = [
  QuestionModel(
    "به طور رسمی آتش بس بین ایران و عراق از چه زمانی آغاز شد؟",
    {
      " ۲۹/مرداد/۶۹": false,
      "۲۹/مرداد/۶۸": false,
      "۲۹/مرداد/۶۷": true,
      "۳۰/شهریور/۶۷": false,
    },
  ),
  QuestionModel(
      "در کدام عملیات ارتباط دریائی عراق با خلیج فارس قطع شد و ایران به مرز بصره رسید؟",
      {
        "کربلای ۷": false,
        "کربلای ۸": false,
        "والفجر ۸": true,
        "والفجر ۷": false,
      }),
  QuestionModel(
      "یکی از بزرگترین و موفق ترین عملیاتهای برون مرزی ایران کدام گزینه است؟", {
    "رمضان": false,
    "والفجر ۸": true,
    "فتح المبین": false,
    "بیت المقدس": false,
  }),
  QuestionModel("تصویب قطعنامه ۵۹۸ در پی کدام عملیات بود؟", {
    "محرم": false,
    "کربلای ۵": false,
    "والفجر ۸": true,
    "کربلای ۶": false,
  }),
  QuestionModel("پایتخت ساسانیان کجا بود؟", {
    "تیسفون": true,
    "تهران": false,
    "هگمتانه": false,
    "بغداد": false,
  }),
  QuestionModel(
      "کدام پادشاه در جنگ صفویان و عثمانی (۱۵۵۵–۱۵۳۲ میلادی) در برابر عثمانیان جنگید؟",
      {
        "جهانگیرشاه": false,
        "نادرشاه": false,
        "شاه طهماسب": true,
        "سلطان سلیمان خان": false,
      }),
  QuestionModel(
      "شاعر معروف حافظ شیرازی در کدام دوره ایران باستان زندگی می کرد؟", {
    "صفویان": false,
    "ایلخانان": false,
    "ساسانیان": false,
    "تیموریان": true,
  }),
  QuestionModel("اولین حمله مغول ها به ایران در چه دورانی بود؟", {
    "اشکانیان": false,
    "قاجار": false,
    "خوارزمشاهیان": true,
    "صفویان": false,
  }),
  QuestionModel("آیین شیعه اسلام در چه دورانی مذهب رسمی کشور ایران شد؟", {
    "طاهریان": false,
    "قاجار": false,
    "صفویان": true,
    "ایلخانان": false,
  }),
  QuestionModel(
    "پایه ‌گذار دولت هخامنشی چه کسی بود؟",
    {
      "شاه عباس": false,
      "کوروش": true,
      "ارسلان شاه": false,
      "هلاکوخان": false,
    },
  ),
];
